rocksdb/experiments/M2/results/20260429-052804-budget-sensitivity/bmin_2_ptarget_0p5/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 05:30:16 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777440616793428 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       6.415 micros/op 155886 ops/sec 32.075 seconds 5000000 operations;  154.6 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       8.276 micros/op 120830 ops/sec 41.380 seconds 5000000 operations;  119.8 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      10.533 micros/op 94936 ops/sec 52.667 seconds 5000000 operations;   94.2 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     16/15  996.55 MB   0.2      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    544.7     27.44             20.94       240    0.114       0      0       0.0       0.0
  L1     14/14  838.57 MB   0.0     25.8    13.6     12.1      22.9     10.8       0.0   1.7    404.6    360.3     65.20             50.41        21    3.105     26M  2866K       0.0       0.0
  L2     89/0    4.54 GB   1.8     23.0     9.4     13.6      17.6      4.0       0.6   1.9    412.4    314.7     57.16             44.91       155    0.369     23M  5546K       0.0       0.0
 Sum    119/29   6.33 GB   0.0     48.8    23.0     25.7      55.1     29.4       0.6   3.8    333.4    376.7    149.81            116.25       416    0.360     49M  8413K       0.0       0.0
 Int      0/0    0.00 KB   0.0     48.5    22.8     25.7      54.4     28.7       0.6   3.9    336.2    376.7    147.84            114.78       407    0.363     49M  8408K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     48.8    23.0     25.7      40.5     14.8       0.0   0.0    408.2    339.0    122.36             95.31       176    0.695     49M  8413K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    544.7     27.44             20.94       240    0.114       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 126.1 total, 123.1 interval
Flush(GB): cumulative 14.598, interval 14.111
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 55.11 GB write, 447.40 MB/s write, 48.78 GB read, 396.02 MB/s read, 149.8 seconds
Interval compaction: 54.38 GB write, 452.31 MB/s write, 48.54 GB read, 403.68 MB/s read, 147.8 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 12, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 12, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 12, total-stops: 0
interval: 12 total count
Block cache LRUCache@0x55600e50bdf0#83678 capacity: 32.00 MB seed: 613598548 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000128 secs_since: 126
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 126.1 total, 123.1 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 119.76 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 119.76 MB/s
Cumulative stall: 00:00:26.454 H:M:S, 21.0 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14529.71 MB, 118.01 MB/s
Interval WAL: 14M writes, 0 syncs, 14427565.00 writes per sync, written: 14.19 GB, 118.01 MB/s
Interval stall: 00:00:26.454 H:M:S, 21.5 percent
Write Stall (count): write-buffer-manager-limit-stops: 0